Repository: 84000/data-translation-memory
Catalog: toh65-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་སྒྱུ་མ་མཁན་བཟང་པོ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་སྟེ། ལེའུ་ཉི་ཤུ་རྩ་གཅིག་པ་རྫོགས་སོ།། །།
en: Among the hundred thousand chapters of the Dharma discourse of The Noble Great Heap of Jewels, this completes the twenty-first chapter called “The Prophecy for Bhadra the Illusionist.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། པྲཛྙ་བརྨ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།​། །​།
en: Translated, edited, and finalized by the Indian preceptors Jinamitra and Prajñāvarman along with the chief editor-translator Bandé Yeshé Dé.
